{
  "projects": [
    {
      "id": "00",
      "name": "Random Quote Generator",
      "github_name": "random_quote_generator",
      "description": "The random quote generator allows the user to have an array of quotes that print to document. It includes a function which randomly chooses and generates the HTML for the quote and a function to randomly select a new color to be used for the background. A printQuote function prints the randomly selected quote into the webpage and changes the background color. It will load a new quote upon page load and an interval has been added to load a new quote every 5 seconds. The user may click the <i>Show Another Quote</i> button to see a new quote, which also resets the 5 second interval.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    },
    {
      "id": "01",
      "name": "List Pagination and Filtering",
      "github_name": "List-Pagination-and-Filtering",
      "description": "script.js reads the student list provided in the original HTML. It has a global variable, countPerPage, within the script that determines the number of results per page. With this set, script.js will determine the number of pages and the show the first page with added pagination at the bottom of the page. Selecting a new page will show those results and update the active link at the bottom. A search option has also been added to search through the names in the student list. Typing in the search input will filter the students and update the pagination, based on your search.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    },
    {
      "id": "02",
      "name": "Interactive Form",
      "github_name": "interactive-form",
      "description": "This is a static HTML form made interactive with JavaScript. When JS is active the form performs the following: The Other job role is hidden unless selected in the job role selection.T-shirt colors will render when the corresponding design is selected.The activity form renders the total and disables activities that occur at the same time.The payment area will show the corresponding information with type of payment selected.The form validates the name, email, activities, and credit card information before the form may be submitted.When email validation fails, the form displays different error messages.Displays an error when a proper email address is not entered.Displays an error when the email field becomes empty.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    },
    {
      "id": "03",
      "name": "Star Words Game",
      "github_name": "star-words-game",
      "description": "A phrase guessing game that allows the user to add several phrases to the Game constructor that others may play. After starting, a new Game object is created, as well as the Phrase object holding the randomly chosen phrase. Players my either click letter on the screen keyboard or press keys on their physical keyboard. The application will check to see if their letter is in the phrase selected. If the player guesses the phrase, they are taken to a win screen. Alternatively, after selecting five incorrect letters, the player is taken to a lose screen. The player may then restart the game and try again. I themed the game after Star Wars and initially provide popular phrases from several of their films.",
      "technologies": ["HTML", "CSS", "JavaScript"]
    },
    {
      "id": "04",
      "name": "Employee Directory",
      "github_name": "employee-directory",
      "description": "The Awesome Startup Employee Directory generates a directory of random employees by making a public api request to http://randomuser.me. The number of employees generated can be changed by updating the numOfRecords variable at the beginning of js/script.js. After fetching the random employee data, the resolved promise will parse the JSON, format the phone number and date of birth, and then call the createDirectory function. The modal window has previous and next buttons that allows one to move through each of the employees shown on the page. Clicking the \"X\" button closes the modal window. Entering a value in the search form will filter the names matching the entered value.",
      "technologies": ["HTML", "CSS", "JavaScript", "API"]
    }
  ]
}
